OpenFOAM/fullSolution/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

3
(
    inside
    {
        type            patch;
        nFaces          1;
        startFace       2999;
    }
    outside
    {
        type            patch;
        nFaces          1;
        startFace       3000;
    }
    sides
    {
        type            empty;
        nFaces          12000;
        startFace       3001;
    }
)


// ************************************************************************* //
