OpenFOAM/fullSolution/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


application     eRhoPisoFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         2e-6;

deltaT          1e-11;

writeControl    adjustableRunTime;

writeInterval   1e-7;

purgeWrite      0;

writeFormat     ascii;

writePrecision  12;

writeCompression uncompressed;

timeFormat      general;

timePrecision   11;

runTimeModifiable yes;

adjustTimeStep  no;

maxCo           1e-6;

maxDeltaT       1.e-3;


// ************************************************************************* //
