OpenFOAM/fullSolution/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | foam-extend: Open Source CFD                    |
|  \\    /   O peration     | Version:     4.1                                |
|   \\  /    A nd           | Web:         http://www.foam-extend.org         |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          PCG;
        preconditioner  DIC; 
        tolerance       1e-20;
        relTol          0;
    }
    p
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-20;
        relTol          0;
    }
    pFinal
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-22;
        relTol          0;
    }
    U
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-20;
        relTol          0;
    }
    UFinal
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-22;
        relTol          0;
    }
    "(e)"
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-20;
        relTol          0;
    }
    "(e)Final"
    {
        solver          BiCGStab;
        preconditioner  DILU;
        tolerance       1e-22;
        relTol          0;
    }

}

PIMPLE
{
    nOuterCorrectors 1;
    nCorrectors      3;
    nNonOrthogonalCorrectors 1;
}

relaxationFactors
{
    U       1.;
    UFinal  1;
    e       1.;
    eFinal  1;
}


// ************************************************************************* //
